{"review_id":"NxL8SIC5yqOdnlXCg18IBg","user_id":"KpkOkG6RIf4Ra25Lhhxf1A","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2011-10-10","text":"If you enjoy service by someone who is as competent as he is personable, I would recommend Corey Kaplan highly. The time he has spent here has been very productive and working with him educational and enjoyable. I hope not to need him again (though this is highly unlikely) but knowing he is there if I do is very nice. By the way, I'm not from El Centro, CA. but Scottsdale, AZ.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"pXbbIgOXvLuTi_SPs1hQEQ","user_id":"bQ7fQq1otn9hKX-gXRsrgA","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2010-12-29","text":"After being on the phone with Verizon Wireless trying to figure out why my phone wasn't working for 4.5 hours, I was put in touch with Sharpie Tech. Well, after 10 seconds they fixed the problem. As the owner of a company that does our best numbers over the holiday season, having my phone out of order for 4.5 hours was horrible. Sharpie Tech fixed the problem in record time, even Verizon was shocked. I highly recommend working with this company and I look forward to working with them more. \n\n-Rachel Charlupski\nFounder and CEO, The Babysitting Company","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"wslW2Lu4NYylb1jEapAGsw","user_id":"r1NUhdNmL6yU9Bn-Yx6FTw","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2011-04-29","text":"Great service! Corey is very service oriented. Works fast and very effiecient with his time. Going to use him again real soon to do additional IT services. thanks Corey.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"GP6YEearUWrzPtQYSF1vVg","user_id":"aW3ix1KNZAvoM8q-WghA3Q","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-07-14","text":"Highly recommended. Went in yesterday looking for a dresser to use as a tv stand. Found the perfect piece for the retro look I'm going for. I found some other small decor items. Price was fair and they delivered today.  Shawn did a great job. Keep up the good work! I will definitely be back.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"25RlYGq2s5qShi-pn3ufVA","user_id":"YOo-Cip8HqvKp_p9nEGphw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2014-01-15","text":"I walked in here looking for a specific piece of furniture.  I didn't find it, but what I did find were so many things that I didn't even know I needed!  So much cool stuff here, go check it out!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"Uf1Ki1yyH_JDKhLvn2e4FQ","user_id":"bgl3j8yJcRO-00NkUYsXGQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2013-04-28","text":"What a great place! Modern on Melrose has amazing furniture at great prices. I highly recommend and will be back when I am looking for new pieces.","useful":2,"funny":0,"cool":1,"type":"review"}
{"review_id":"oFmVZh-La7SuvpHrH_Al4Q","user_id":"CWKF9de-nskLYEqDDCfubg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2014-10-12","text":"A hidden gem! Found a beautiful buffet for a great price. Whether you're looking for new or something to refurbish, this place is def worth the look!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"bRvdVt88MJ_YMTlLbjDLxQ","user_id":"GJ7PTY7huYORFKKg3db3Gw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2012-09-18","text":"This place is a great for those vintage\/mid century modern finds. From clothing to couches they have it all and great prices too.  They have similar items to their neighbors Modern Manor, but not the \"designer\" prices.  We got a green vintage chair for $98 and just are having the skirt around the bottom removed to show the great legs on it.  We will always check back at Melrose when looking for unique pieces for our home.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"zNUSxqflZKgKD1NQH3jdFA","user_id":"rxqp9eXZj1jYTn0UIsm3Hg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2015-10-11","text":"This is the place to go for all your Mid Century finds.\nWe live in Oro Valley and it is not too far to travel when we need a specific item.\nI called yesterday asking if they has something we need and minutes later I was text numerous pictures.  Because of the excellent staff, I will be going up there today.\nOne of my number one places to go when I go to Phoenix.\nPrices are very fair for these past treasures.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"LkP1l7sZIwOV6IKNLqQp_A","user_id":"UU0nHQtHPMAfLidk8tOHTg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2015-04-05","text":"Great items at a good price.  Helpful, easy to deal with owners.  Just the sort of place you LIKE spending  your dollars at...and they have furniture, etc. that you don't see elsewhere.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"MvvT0BtQH9wq7K-pPgkoEQ","user_id":"A_Hyfk3FcwFVIk1CQC7z7w","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":1,"date":"2014-07-08","text":"Disappointing.  I've been there twice hoping that a re-return would change my original opinion.  The first time I was there was on a Saturday, early afternoon in Spring.  I found it strange that I was the only one in the store for about 20 minutes, until another customer came in.  Melrose is usually a pretty happening place during the Spring before summer temps hit.  I saw a lot of nice 1960s furniture, mostly living room sets and home decor.  Prices were on the high end for, let's face it folks, used furniture. The blonde lady who came out to greet me after I made it to their second room (there are 3 rooms total) was frazzled and preoccupied with eating her lunch. So I went back again last week.  Didn't see the frazzled lady from before but a mid-age hipster guy at the counter who didn't have the time to greet me (sorry I disrupted your cell phone surfing).  Yep.  I was the ONLY person in the store and you obviously ignored me.  \n\nIt's just an unwelcoming place.  So much potential, but the attitude there is less than acceptable.  Will spend my $$$ elsewhere.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"dJguzIfNKtGkKk8ryOPdfQ","user_id":"OvD92wp0-uuFoGLBymwfKQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-23","text":"I'm a local Real Estate agent and have fallen in love with all of the AMAZZZZZING Mid-Century Modern properties that the Phoenix and Tempe area have to offer. After listing and selling a few of these COOL homes I decided that I should be more familiar with a few MCM furniture shops that I could buy or lease a higher quality furniture. \n\nAfter going in a bunch of places I can say that I really love this store and cant wait to use them to stage my newest listing in a few months at 24th and Indian School.\n\nLet me know if you need help finding a cool house with character to put your amazing finds from Modern on Melrose.\n\nEnjoy\n\nSteven\n480-370-5570\nstevenonmill@gmail.com","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"l-yhe0IFJ7WTgEk0qD8yqA","user_id":"5NDk-q5mv8PIDvz83HwMVg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2015-01-13","text":"Modern on Melrose is one of our favorite shops on La Curva. It is on the pricey side (of an already pricey shopping experience) but I've had great success for two reasons:\n\nFirst, the service has been excellent and friendly. We're new to the mcm scene and didn't get snubbed at for not being \"in the know\" -- sadly, this was a welcome relief. \n\nSecond, the selection is good. Yeah, it's always a hunt, but at MOM you aren't going to be sifting through, basically, garbage to find your treasures. With most of the weeding done for you, the store is a much nicer visit.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"cNA3oGTmmeRvt10vrvlJOQ","user_id":"AziQIgYIAY6uVw1k8sbtTw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-05","text":"Walked into the store and stuck up a conversation with Shawn behind the counter. We talked about some furniture and other ideas I had for the home. I told him I needed a custom made shelf. Shawn asked some questions and then he sketched out a concept. I loved it. He then said Modern on Melrose has a man that does custom metal work. Three days later-it was done and it turned out better than I could have ever imagined.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"S_Z5aqlpTVkR9RmYvcPpTQ","user_id":"A65IYKs3FwsyyJH20XOk2w","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-12-22","text":"What a lovely place. My boyfriend and I went along with my parents (who love mid century modern furniture) just to look as I am moving soon and can't buy any furniture until I relocate, but this shop made me want to move to downtown Phoenix and fill my house with everything in this shop. My thrift-genius parents taught me to buy antique furniture and never ever ever buy new, as new furniture is expensive to buy and cheaply made. Modern on Melrose is fantastic proof of this - my boyfriend fell in love with a yellow leather and wood 70s couch and noticed that this beautiful couch cost less than a couch our friend recently bought at IKEA. And no one is going to buy IKEA couches in antique stores 40 years from now, because they barely last 1 move. \n\nEverything in this store is gorgeous and there is a great variety of furniture and random decor goods. We ended up buying some great stacking canisters as a gift, and the very helpful employee dashed back to the area we got them and told us they were 40% off. We debated keeping the canisters because they were as affordable as they were quirky and useful and interestingly designed, but the Christmas spirit prevailed and we decided to give them to their original recipient.\n\nThe same employee discussed style and furniture things with my father in a very helpful and absolutely non pretentious way, which is a refreshing and fun element of any antique store. I always want to talk to the employees but very often feel they are too busy or want to sound smarter than me (which they are, but I'm not buying anything if the person I'm giving money to makes me feel stupid). I was very struck by how open and helpful the employee was. Great experience. Great selection. Great prices.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"klVqdjXPM2aM8Y0RsDCPoA","user_id":"wnzfuir72IZFg5RAPOwWCQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":1,"date":"2013-11-17","text":"Unfortunately, Yelp does not allow negative stars. I was very much looking forward to going to Modern on Melrose as my sister had raved about the selection and several purchases she recently made here. I was all set to help her select more furniture for her new home until I experienced a combination of disbelief, shock and horror. \n\nI was inside the store when I heard a man loudly say \"If you're going to start a sale, finish it!\" It took a few more seconds of loud voices before I realized an argument was taking place between two employees and not two customers, as I initially thought. The male and female employee continued to loudly argue, back and forth. Feeling very uncomfortable, I started to look for my sister. There were about four other customers and we all ended up outside as we all felt very uncomfortable in the store. \n\nAs I was walking out of the store to go out back, I heard the male employee say, in a tone that was beyond anger but instead violent, \"Don't you ever tell me to shut up! Ever!\" Shortly after, he walked past all 5 female customers, who had gathered out back, turned to us and angrily said \"Bitch!\" Not knowing what he was going to do when he returned, we decided to leave as we did not feel safe. \n\nIt is one thing to feel uncomfortable, it is completely unacceptable to not feel safe. The interaction between the two employees was the most unprofessional thing I have ever witnessed. The male and female employee were so caught up in their own negative interaction, neither of them offered any customer service. And after their argument ended, the female employee offered no apologies and still no customer service. \n\nToday was my first and last time in Modern on Melrose. How terribly sad for this store. I sincerely hope the owners get a handle on this and educate their employees as to what it and isn't acceptable behavior.","useful":4,"funny":3,"cool":2,"type":"review"}
{"review_id":"Lulhm9mWWcgndcuc_zsgPA","user_id":"2N9wrn5A37aOXDrBPIYQdA","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2013-07-10","text":"Favorite vintage store I have been in. I have been going to a lot lately looking for midcentury furniture that won't empty out my bank account. Happened to drive by this place and decided to take a look. I got a 3 piece coffee table and side tables set for 60 bucks. Can't beat that. The lady working I completely loved! She was helpful and let me know what kind of stuff will be coming in. This will be a weekly stop for me. \nIf you are looking for awesome vintage furniture in good shape this is the place to go. They know their stuff. A lot of awesome lamps and boomerang coffee tables. It is a must visit.\n\nupdate: seems like items are getting higher and higher. style has changed a bit. still nice stuff if you wanna empty your bank account. no longer a weekly stop but i will still  stop by.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"k4xighfFxKv5H-Eic28MNQ","user_id":"oKZiDLm0D1PIm1-vRtvONA","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-23","text":"I stumbled upon Modern on Melrose earlier in the week in my search for bedroom furniture. I had been a a few other shops but nothing caught my eye. When I walked in I knew immediately that I was in the right place.\n\nThe store is very well curated unlike many other vintage\/antique shops. I spent a few minutes looking around (I don't like to be bothered right away when I come in to a store). Cynthia greeted me warmly and I asked her to help me pick out some bedroom furniture. She asked me about my style preferences and showed me around. She noted what I liked and didn't like and made informed recommendations. It took me all of ten minutes to pick out the furniture I wanted. Cynthia actually asked me if I wanted to take some time to consider my purchase (not pushy at all!) and I told her I loved everything and I wanted to take delivery as soon as possible.\n\nI then asked Cynthia to help me find a pair of lamps for the bed side tables I purchased. This time around I wasn't really loving anything but she took the time again to show me around and listen to my input. \n\nAnother reviewer mentioned that their pieces are pricy and that could not be further from the truth. I had found some lower end shops that did not have the quality I was looking for and I also found some very high end shops. Modern on Melrose has excellent prices and the quality to back it up. I was pleasantly surprised by the value they provide.\n\nI was able to have my furniture delivered the next day and I'm loving my new (old) furniture. I highly recommend you check them out!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"U617X1icAyAC5hbjsnhcpA","user_id":"XMRkVYpQAZpWOpia5-MoPw","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":1,"date":"2010-02-16","text":"Overall, I'll never go back. Rewinding to the reason of my conclusion: messy racks, bad choice on jewelry, no focus on fits whatsoever, no pricing consistency, and paint-scraping help from the hired help (owner of Red). I felt like I was bothering someone instead of shopping. \n\nI recommend Retro Ranch, Fashion by Robert Black, France's or the new Vintage shop next to Hula's and Lola Coffee on Central Ave.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"_a7Zu2ZSEGO4bl2gvu7OtQ","user_id":"jhhHm3Vk9ZlP21WdY_5R0w","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":5,"date":"2009-04-10","text":"I love Mint, and even though I'm a guy and there isn't much for me there, it's a great place for gifts for the lucky gals in my life.  It's definitely worth checking out, despite what the other reviewers have said so far.","useful":2,"funny":2,"cool":1,"type":"review"}
{"review_id":"5hU8Uxdem1j_PEr4HFs5HQ","user_id":"9Cmmt_34PxuC84P1AgmetQ","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":5,"date":"2009-01-30","text":"I read the reviewer before me and checked things out for myself.  I don't know about the size 0-4 comment because I found 3 dresses all over size 8 and some great necklaces all very reasonably priced.  Rumor has it the day to go is Sunday or Monday, which is when more things are added to the inventory.  I also left my name and email because I was looking for a vintage Chanel bag and I got an email when they got one.  I can't afford to shop on the furniture side of the store but I've found a lot of great funky things at mint.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"RAzbLYbgw3tNv8Tu0R7qmQ","user_id":"B7ecAeAIrXg7sgmabS38pg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2007-12-15","text":"Hmmm, what to say about Mint.\n\nOkay, if you are a girl and looking for clothes here, I'd say pass. Unless of course you have a tiny waste and are maybe a size 0-4 on a good day. If you are looking for funky earrings, it might be worth a stop, but the majority of their earring inventory was kinda weird and a little too 80's inspired for my retro taste. If you are looking for stellar quality (and priced accordingly) funky retro furniture, then definitely pop in here as their selection is really cool and there were a ton of pieces that I easily would have purchased. As for the rest, I'd say hit this store up every once in again and see what they have to offer and if they start carrying bigger sizes in dresses, lemme know :)","useful":5,"funny":5,"cool":4,"type":"review"}
{"review_id":"0-emituHrxFvtYJZVhr2tA","user_id":"mdVHZbSl97wUUoE6hdxeLg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2009-09-07","text":"I like this Vintage\/New shop.  I think they need to do something about getting new (vintage) items in more frequently there are things still there from visiting almost a year ago.  Overall I have bought some great finds there and will most definately go back.","useful":3,"funny":1,"cool":2,"type":"review"}
{"review_id":"dfL5TyVib8uZgxaNMwx7Aw","user_id":"je5k8a3qIOM0VJE5MaxsfQ","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2009-02-01","text":"I remember really enjoying browsing through Mint (and their furniture friends Red) before, I love mid-century Modern (but what casually reading Dwell but highlighting Ikea pseudo-art bitch DOESN'T?) , I like interesting jewelry, I think the space is really intense, like I am in a dream of some sort.\n\nBut I went recently...and I just didn't like it. Sure, these are collectible pieces, goregous condition, the space is well cared for, I don't expect to afford these museum worthy pieces, especially at 11grand for a chair and ottoman (oh god, I hope the ottoman was included in that price....), but the affordable pieces of bracelets, earrings, clothing...um, it was a lot of the same items I saw here over a year ago...actually more like TWO years ago.....so, the inventory isn't very turnovering or fresh...so I guess Mint isn't so fresh?\n\nOverall, I was underwhelmed, I didn't feel particularly welcomed either time I was here, and the stock continues to center on polyster 70s clothing and BCBG tops (?) making an uneven style feel and chilly ambiance.  \n\nDefinitely not worth a stop.","useful":3,"funny":4,"cool":1,"type":"review"}
{"review_id":"z5OD5c-nu2v1xwfG0mAIiA","user_id":"TryfbZaaGtedncOMq9k86g","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":4,"date":"2007-03-04","text":"The vintage 1930 beaded earrings are still calling to me.  I can hear them.  Knowing I saw similar ones being sold for $15 at Cost Plus vs the $60 for the vintage ones helps a little - but not much.  \n\nVery cute vintage accessories and clothing.  I almost teared up seeing a super cool crinoline like the one I had in high school.  (Yea, sometimes I was that girl.  We're moving on...)  Really great stuff.  A bit high priced, but not when you consider it's quality. Everything they had was great.  It didn't feel like estate sale shopping, ya know?\n\nThen there's the other 1\/2 of the store that is an art gallery.  Somehow it just works.  Here the prices were extremely reasonable.  Some really great stuff too.  \n\nIt's behind much of the Roosevelt Row stops, just a bit behind Holgas.  Cool, yet approachable.","useful":2,"funny":1,"cool":0,"type":"review"}
{"review_id":"fA2NFb69SvDCsB7WSpY2rw","user_id":"yt1VnahG-MRgU6tswWaUxA","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2010-03-01","text":"Well.. Well...well..Ive been highly recomended to check this place out, now that I had a chance to see what the hype was all about. I can see for myself that they had very cool pieces of funiture and retroesque clothes. Very impressed up until I asked for some help and questions, and thats were the place lost its apeal. I was quickly imformed that they delt with very high end resorts and hotels, and as for myself adding these pieces in my store would not be a good idea.I think coming in would be a great experiece for someone to see bad service at its finest.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"OiB7X9UxftB0WAWgd2KdJQ","user_id":"wJ0mbYw5WoiaKxiNEayZvg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2010-05-14","text":"Red's merchandise is amazing. Mint's left a little to be desired...ok alot to be desired. Alright, cranky service be damned (now this is a store within a store. it is all the same service for both. it is  just that Red's merchandise is so untouchable (literally even! \"do not sit\" signs abound) that you almost feel like you deserve the treatment because your lusting after, yet can not afford their wares)..... I have ventored into this spot appx twice a year since it has opened. Why am I still starring at the same clothing? I know my sticky fingers have not picked up a frock I could not live without but then I figured it was because I am  both cheap and picky. A hard to please combo. Seriously though, I have been starring at the same stuff for years now. Boring.","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"ezuT8BpvhLITCfbQEWddsw","user_id":"29rUYREQxeFE6LWGnirgew","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2011-01-14","text":"I have been consistently underwhelmed by this place since I moved to the hood a year ago. With so many great vintage spots and local boutiques so close why should anyone make the stop at this over priced and under-friendly place? Your lucky if you get so much as a \"Hi!\" here. The vintage clothes are so so and I have been looking at some of the same ones for over a year now. Go to the 7th avenue shops if you want a fun and friendly vintage experience.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"IXQgVQJUQoJ6sKxV7-cREQ","user_id":"zOU38EUHgUtEI4ziZ8DB1w","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":5,"date":"2011-10-19","text":"I highly doubt anyone uses Yelp to find a place like this, but figured I'd write them a review because WSP rocks!\n\nAnyone in the Phoenix area with a need for any type of specialty fuel...look no further.  Personally I use them to purchase methanol for a water\/meth injection kit I have in my car, and their prices are literally the lowest I've seen in the country for methanol.  Paid $3.49\/gal today.  In addition to methanol, they sell every type of fuel, oil, lubricant you can imagine.  Race fuel, AvGas, E85.....etc\n\nAnd different from lots of other industrial-type places, everyone that works here is incredibly helpful and nice.","useful":1,"funny":1,"cool":0,"type":"review"}
{"review_id":"ojtDaz6oAxS74VnAAjb4NQ","user_id":"hMZ3_yBErMi-pFcquyLJWg","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":5,"date":"2014-04-26","text":"This place is great!  I first came here to fuel up my old Mercedes on B99.  Even though I live in East Mesa, I would attempt to get there as often as possible, as they are the only place in the valley that will pump B99.  The staff is always friendly and helpful.  The only complaint I have is that their hours make it difficult for me to get fuel.  I understand this, however, as most of their business is from bulk specialty fuel sales, not B99 fill ups.  In response to Sara U, you really have nothing to worry about for getting 5 gallons of E85.  Your car is already running on 5-10% ethanol every time you fill up with unleaded.  I wouldn't do it on a regular basis, but it is not like you put diesel in a gas vehicle or vise versa.   Just fill up with regular unleaded, then have somebody clear your check engine light for you.  It will probably throw a code about the O2 sensor, not because it is broken, but because the oxygen content of the E85 is higher.  It shouldn't come back on.  And no, I don't work there.  I'm just a scientist who knows a thing or two about fuel!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-6wjE08Pf8oWrZQQocEgHg","user_id":"9sdni8QHrai8l7ikHsV5Jg","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":1,"date":"2014-04-23","text":"Dave S can kiss my heini .. I called them to ask if they fuel up regular unleaded gas before going down there and they said yes. They need to inform their customers correctly and label their tanks in addition so it's obvious what they are actually putting into your vehicle. By the way Dave, they put UNLEADED REGULAR fuel (not biofuel) in my tank to dilute the E85 (duh) after they realized they made the mistake. My service engine light has now come on thanks to these idiots.\n\nYou obviously work there Dave. Get your facts right.","useful":0,"funny":1,"cool":0,"type":"review"}
{"review_id":"6-hKBi-6RC3g7Mft0c-6qw","user_id":"PmgqNO0-5Y3e3UoR61TD7w","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2014-03-29","text":"This place is a area staple! Been around for years and not much has changed - I see this as a good thing! Stable and reliable!\n\nMy family goes every year for St. Pattys Day corn beef! Very nice place for a bar night dinner, or to catch up with some friends over drinks!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"tRd0-mPa9O1TMJp_dw5khQ","user_id":"kXUySHSlRgVrcR4Aa0HtGQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2014-08-14","text":"Got my mojo back after having a few of their appetite teasers. Love LPW for a no-frills bite to eat.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"8Mu56iQ-MYEyivqUVss0XA","user_id":"SYKPwRhnlKrW6yTvm7oPWg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-10-20","text":"Don't go here for the decor, but the staff is friendly and the fried pickles are very tasty.  Good value.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"ToC77cIEiMas9CPU7dt_fA","user_id":"7LCG3o2KW2jgKgbKN0DQOg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2012-08-25","text":"I believe in awarding stars bearing in mind the type of restaurant reviewed. \n\nOne can tell by the name that LPW won't replace Ohio's lost Maisonette restaurant in Cincy any time soon, nor does it aspire to do so, but for a sports-bar type venue, these folks do it all right, and do so at the right price!\nStopped for lunch on a Saturday.\n\nThe lady got a cheeseburger and fries, I got scrod and broccoli, we split an order of their fried pickles as an app.\nThe pickles were dill spears coated with just the right amount of what was likely a beer batter and deep fried to tangy perfection.\nThey got the spears vs. chips decision right!\n\nThe lady usually looks askew at this type of fare, but happily camped out over the plate and ate her fair share! \n \nAnd here's the kicker they were under four bucks! \n\nKudos Mr. Pickle; you done good!\n\nThe fries were very lightly battered and done perfectly, with just the right amount of crispness outside followed by a creamy interior, ... the fry guy here knows his craft!\nAnd the burger was good as well.. ...typical of the genre.  \n\nI find it difficult to fawn excessively over  a burger.\n\nThe scrod was a very generous sized portion, nicely caramelized and served with lemon and butter and perfectly done.\nWhen I was given the option of fries or baked potato or rice I asked if there were a green option and broccoli was offered, it was done perfectly as well and the amount was easily enough for two to share.\nMy dinner came with a salad, which happily WAS NOT from a bag-o-lettuce, but rather freshly cut romaine, a cuke slice or two, carrot shreds and tomato, and it was accompanied by a store bought dinner roll and butter.\n\nThe service was quite good, although the waitress appeared to be a bit over-extended, but that's a management issue, not the server's fault.\n\nHappily they are in the Cleveland Entertainment book, and as I had the coupon sitting on the table during the meal, the waitress took the value off of the ticket before it was even presented!\nI'm all for efficiency, especially when it affects how quickly I can get out of a restaurant.\n\nThat move garnered the fifth star!\n\nWe both stated that we will go back in a heartbeat!","useful":2,"funny":0,"cool":1,"type":"review"}
{"review_id":"6YC4o9yLc25DK8c6soOlaw","user_id":"iSdSNh1hjdE33LOwrFnFrg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2015-07-27","text":"If you like fried food and laid back, then this is the place for you.  Nothing that will blow your mind, but the people are great, the restaurant is laid back and casual and the food, while not very creative, is cooked well, presented well and the prices are not ridiculous.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"T5Xa-KKFqgXdbFnATZA4gg","user_id":"catpxxLS6OF5cfjxLvpAbA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2014-02-24","text":"THE CLASSIC BURGER IS AMAZING.  It's definitely a top ten burger. The fries are good too.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"JYyKOtLznozAlT8P1Foaow","user_id":"Zmp1Q6Ul9VH3zL02Z5ls_A","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-03-16","text":"I was not impressed with how gross this place is - I wasn't sure I wanted to order anything. The food was not outstanding. I think I would go across the street to the Tavern!!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"4FnZR30PtlEb1Ifi7S65bg","user_id":"vzKgTUCV5Pz0gldaeM5j3g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2015-09-05","text":"Okay bar food. Nice bar setting but food is average, service is average and in general doesn't really art itself apart in anything. Would I go there again? Probably if I'm in the area. Would I go out of my way to go there or make note of it to others? Probably not vegetable soup was good though and wings were fairly priced.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"6GBjCBVtPGsnQ67neAAkjw","user_id":"i8hCMZN-0bHENsHZKHpC-g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2011-05-25","text":"Was boozin and cruisin with my canine comrade. Went all the way out to Hudson via Brecksville\/82. Looking for anything to Yelp. Nothing. Not even in the strip mall I used to hit in Hudson on my dry cleaning route back in the day. There was a deli, but it opened at fucking 11! Who even wants to go to a deli after 11? Weak. Breezed through Peninsula. Winking Lizard? Bah. Ended up backtracking through Brecksville and I remembered an old friend. London Pickle Works! Was it still there some four years after I stopped in while house shopping? Yup. Incidentally, investing in a condo down there probably would have made more sense than buying a house in Lakewood. Live and learn.\n\nCozied up to the bar and ordered a Killians, plus cheesesteak to go(for pooch). Like the Unicorn, food was amazingly done before I could chug my brew. I could get used to this kind of service. The bar was all old men. Matt, I don't know how you do it. They were watching Fox news for chrissakes!! Total was eight dollars! Holy shit. I dropped a three dollar tip on that barmaid's ass. How could I not? A real meal at fast food prices, at fast food speed, served by someone not under house arrest with work privileges. Busted open the styro box. Big sandwich with mushrooms, onions, cheez and beef sliced so thin I swear it was a Steak'um. I never ate those as a kid, but I remember one time my friend had one in his bedroom where we were playing NES. He didn't want it, so we threw it all around the room. Fries were awesome. Also got a pickle. That's eight dollars with the beer, just to recap. Great value, nice location, old men. I won't wait four more years to come back.","useful":7,"funny":7,"cool":6,"type":"review"}
{"review_id":"CdBHQT3WuYuQf-VQ1Um8tQ","user_id":"OdTvOw8NKzaCcsj_dnRZSQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2013-02-12","text":"Alright, i was about to give it 3 stars bc it's not that great, but it's super cheap... wait, but it's kinda filthy too, so umm, 3, final answer.  The food is edible, but a bum could afford to eat here, so i mean, it sure beats eating out of a dumpster.  Cheap brews, cheaper food.  I think the building is made out of iron, my phone practically turns off whenever I go inside.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"FFTN8Y1U9G2F_p1dQnxO7A","user_id":"W4cfK8SxPloWtIXl3JST2g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2016-05-11","text":"Okay, so it is a bar with an old fashioned family restaurant attached. We were there almost 2 hours for the Tuesday night burger special. They need more staff. The table was a little sticky. However, the food was delicious. The French fries were nice and crispy, and the Half pound burger didn't taste like a pre-made frozen patty. Our total bill was $15.30 for 2 meals and 2 Cokes. We'll definitely go back.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"VlDz03s9VyODcVi1S9-Yfw","user_id":"n5P4Cw7F1pCYwVutSTqUPg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2016-05-04","text":"3 stars is fair for this pub. \n\nThe food is good and well priced for a bar. \n\nTuesday has $5 burgers and chicken sandwiches. \n\nThe pecan pie is good for dessert. \n\nI got the chicken dinner, it came with a 6 oz chicken, broccoli, steamed potatoes, salad, and roll. It was ok. I'd stick with the burgers though. The salad was fresh. \n\nTheir fries are really good.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"HbnWR7vaXD5FLCcrrMAGhg","user_id":"ub50UE95-gu7yIoed1zssA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":1,"date":"2016-01-23","text":"Unmmmm, no. It's a bar with tables in the next room. It's feels grungy. Service was good, food, not so much. Praying I don't get sick!\nEverything tasted like it came from a can! Nothing fresh or tasty about it. \nGuess who won't be back?","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"YGfi1F_Fuc_OyemfqQFspg","user_id":"57w8gLY3f7OwGmWNtUIFIA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":1,"date":"2016-03-17","text":"Have dined in twice now and today was take out for corned beef sandwich. I don't know why I keep thinking this place is going to change. Food is at best \"ok\". The inside is a dive needs some serious updating. This would be ok if this place was a hidden dive bar with amazing food- not the case.\nToday's lunch- puke. Dry corned beef, probably the worst I ever have had. \nLession learned never returning.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"cTNeflcioISILyhQpt0HDA","user_id":"RlpkcJqctkKXl-LO1IAtig","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2016-08-01","text":"This place is very dark and dingy on the inside. It is the cliche of townie bar. The food was just okay but the drinks were super cheap and the service was good.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"FM3Uo0F_2BHp1JdxR5nqvQ","user_id":"m5iFZbW5hSNPNplx-vGkyA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2013-06-12","text":"This small tavern, has great burgers and the best fries within 100 miles!  It's simple, unpretentious, and the folks are mellow and ready to accommodate their customers.  I understand they added music on the weekend and will surely check it out on the weekend.","useful":1,"funny":0,"cool":1,"type":"review"}
{"review_id":"Pqe0NlNUcxzEnUXALZviuA","user_id":"1-xPzJk_ijBvY2J8Re1DIQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2011-04-01","text":"The food is typical.  Wait how much was my meal... Then that food is awesome!  Very friendly atmosphere.  Prompt service.  Diner\/Bar type place with no particular theme.  (Sorry if there is an attempted theme.  I didn't see it.)  Not a foodie spot or hidden gem, but something about this place just feels... nice.\n\nSide note: My apologies for my complete unintentional dine and dash.  Wrong card.  Also sorry to the other guest whose bill I signed for them.","useful":0,"funny":2,"cool":0,"type":"review"}
{"review_id":"vAuh2cggRJI1ZUqiZDEjHQ","user_id":"oPQAJEiJnRrD0Km5RlKmtw","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2016-08-14","text":"There'a a reason that everyone loves this place; it's your typical neighborhood bar in the evening (it's typically middle-aged locals, not a rowdy crowd) but it's also a great place to grab a nice meal with your family during the day. They also have a fish fry every Friday during Lent. The food is really good for bar food, and it's very reasonably priced. Obviously, this is not five star fine dining, but if you're looking for a cheap and inviting place to hang out with friends and family, this is a great place, and the food is great for what it is.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"sKStdKdvO5nIn1ZN0OC-cg","user_id":"bZBPVRIGQZ0WXRYLtYXbYQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-04-01","text":"Not particularly good. Bathroom is nasty. Food decent. Terrible cell phone signal and no WiFi. Probably won't return.","useful":2,"funny":1,"cool":1,"type":"review"}
{"review_id":"uVdnYmlXio7BqtfmZZU-0w","user_id":"fflaErtSIUWvHe3q0I3JAA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-01-23","text":"Went here last Friday for dinner very disappointed!  Waited for ever for someone to tell us to seat ourselves and then waited forever for the waitress to come over it seemed they were very busy gossiping at the counter.  Food was so-so nothing special the salads good use cheese served very plain.  Better restaurants nearby.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"f0l_4MrqYjVCOZq_PowquQ","user_id":"BRO98wNeY2Q_BZX8G-iVvg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-05-01","text":"I can't give this palce 5 stars because hell, its just not a 5 star place.  But it's the Pickle!  If ever in Brecksville stop over at the neighborhood bar for cheap, quality food (you get what you pay for though), a typical old bar atmosphere, free popcorn, and sit in chairs that I swear haven't changed since I was 5.  The place is awesome, I'm there every weekend.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"QfnIyQ5wYk2NDWSLYkSbgQ","user_id":"qn7SAaO9Jwl2ls5c9Og2yA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-03-01","text":"Great prices.   Good food. Typical fare: burgers chicken, fish, etc  Really friendly and eccentric staff. This place is a keeper.   Try the hot pickle. I buy them and use them in bloody marys.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"QVS_4D3lLpilcljTSzKtcw","user_id":"7phnWalwWR0LcV-4xGGFgg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2015-11-21","text":"Neighborhood bar, with the friendliness that comes with it.  Also the quality of food you would expect. Family friendly.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-K5z7DzXHJgEC1tsTLfFeA","user_id":"C0jquh-km5UnawqDqSQpBw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2009-09-15","text":"We came here for dinner to celebrate my friends Birthday.  The restaurant itself is beautiful and the service is incredible but for some reason I felt like something was missing.  The food was decent but way over priced.  I guess for the money we paid I was expecting something else.  Overall it was a nice evening and my friend had fun so thats all that matters right?","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"2tjghSImOPf4A9L4zhByRQ","user_id":"cPifBB7Qbjs9PntPGOY9iQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2010-11-25","text":"Ah, Khotan... I knew you when (SIGH) you were something different.... a perfect blend of Asia's decor and food... and how far you have fallen since that time. While I still appreciate your service and your stunning looks, I am surprised by what has happened to your menu... sorry looking sashimi (though the uni was a standout... shouts out to Santa Barbara!!), uninspired hot foods (kung pao shrimp at $21? For real?? ).... even the drinks are sorry in comparison to what once was.... SIGH.  Perhaps this is why you are closing your doors from November 30th through January 3rd (Seriously? During one of the busiest times of the year in Vegas!?) At least you still have your Treasure Island pirate show, which will always be a sight to behold. Perhaps you should visit what you once were (read: Social House at Crystals) and reclaim your glorious days. Until then, I will continue to hold onto hope that you will find your spotlight (or at least a better menu) once again.","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"fCVQlHk6x7-S2FWWMbOWpA","user_id":"pgTz-Ds6WvS8qFOsRekG9A","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-01-13","text":"Khotan sucks as a place to eat. The girls and I went to this place for \"Dinner\" but really all we got was appetizers. We went during happy hour so it was suppose to be cheaper, but it don't mean the size is bigger. I ordered some spicy tuna and it was $7 for like a tiny portion that didn't do anything for me at all. The roll were so tiny it was about the size of a quarter and I got four of those. BOO times 2. The only reason this place got two stars out of me was the bartender. They both were entertaining and he gave us some drinks for free. Atmosphere is really not impressive either.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"N42b2u6YSL5iEjN6NnrKeQ","user_id":"GDeoUHALgyqK13ewN92Jnw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-09-06","text":"My boyfriend and I decided to go resturant hunting on our visit in LV for our 1 year anniversary..we didnt have a spot in mind but on our many, many, many walks on the strip we found Khotan. \n\nSo I decided to call and make a reservation since I didnt know whether it was a forsure spot we would get in for dinner. *WHICH I DO RECOMMEND, BTW!* We got there and were greeted and waited in the longue\/bar area..it was def cute, we were soon taken to our seats in the patio area (which i also do recommend esp if you come around the 9 o' clock time frame for the pirates show.) OMG, when were going up there are beautiful gold deposit boxes all around then you hit the patio\/seating area and you get a great view of the strip AND the pirate show..feels  like the fireworks are going to hit you haha.\n\nThe food was great, me and my bf def recommend the chicken lollipops for a appetizer (get two bc i could finish that whole plate if i didnt have to share with my bf HAHAHA). You def wont regret it, I ordered the Khotan Beef plate and it was actually good! I wish it did have a little more but I was full forsure. My boyfriend had the Orange chicken plate I believe and he enjoyed that plate as well although he did wish he had more food on there...just b\/c hes def a fattie. haha\n\nOverall, great place for some pan Asian food, GREAT SERVICE btw!, great views, free show of the pirate show w\/o the bussling of the crowds, patio seating is great and def a great overall resturant in vegas.","useful":2,"funny":1,"cool":2,"type":"review"}